import React from 'react'
import styles from './TermsSection.module.css'

export default function TermsSection() {
    return (
        <div className={styles.terms}>
            <span className={styles.title}>Όροι Χρήσης</span>
            <p className={styles.lastUpdate}>Τελευταία ενημέρωση: 26/02/2025</p>
            <div className={styles.paragraph}>
                <b>1. Εισαγωγή</b>
                <p>Καλώς ήρθατε στο Logistok, ιδιοκτησία της Groundo Development. Οι παρόντες Όροι Χρήσης διέπουν την πρόσβασή σας και τη χρήση της πλατφόρμας μας. Χρησιμοποιώντας την υπηρεσία μας, αποδέχεστε ανεπιφύλακτα τους παρακάτω όρους.</p>

                <b>2. Δημιουργία Λογαριασμού</b>
                <p>Για τη χρήση του Logistok, απαιτείται η εγγραφή λογαριασμού. Οι χρήστες πρέπει να παρέχουν ακριβείς πληροφορίες και να διατηρούν την ασφάλεια των διαπιστευτηρίων τους. Η πρόσβαση επιτρέπεται μόνο σε εταιρείες και επαγγελματίες.</p>

                <b>3. Συνδρομές και Πληρωμές</b>
                <p>Το Logistok λειτουργεί με συνδρομητικό μοντέλο και προσφέρει επίσης δωρεάν πλάνο. Δεν παρέχονται επιστροφές χρημάτων για πληρωμένες συνδρομές.</p>

                <b>4. Δεδομένα και Απόρρητο</b>
                <p>Συλλέγουμε και αποθηκεύουμε δεδομένα χρηστών, όπως οικονομικά στοιχεία και στοιχεία πελατών. Τα δεδομένα δεν κοινοποιούνται σε τρίτους, αλλά ενδέχεται να κοινοποιηθούν στο μέλλον.</p>

                <b>5. Επιτρεπόμενη Χρήση</b>
                <p>Απαγορεύεται οποιαδήποτε κατάχρηση της υπηρεσίας, όπως παράνομες δραστηριότητες, απόπειρα παραβίασης ασφάλειας ή παροχή ψευδών στοιχείων.</p>

                <b>6. Διαθεσιμότητα και Περιορισμός Ευθύνης</b>
                <p>Δεν εγγυόμαστε αδιάλειπτη λειτουργία της πλατφόρμας και δεν φέρουμε ευθύνη για τυχόν απώλειες λόγω διακοπών ή σφαλμάτων.</p>

                <b>7. Τερματισμός Λογαριασμού</b>
                <p>Διατηρούμε το δικαίωμα αναστολής ή διαγραφής λογαριασμού σε περίπτωση παραβίασης των όρων. Μετά τη διαγραφή, τα δεδομένα σας δεν θα είναι πλέον προσβάσιμα.</p>

                <b>8. Επίλυση Διαφορών</b>
                <p>Οποιαδήποτε διαφωνία θα επιλύεται μέσω διαιτησίας ή δικαστικής οδού, σύμφωνα με την ισχύουσα νομοθεσία της Ελλάδας.</p>

                <b>9. Τροποποιήσεις των Όρων</b>
                <p>Διατηρούμε το δικαίωμα να τροποποιούμε αυτούς τους όρους οποιαδήποτε στιγμή. Οι χρήστες θα ειδοποιούνται για σημαντικές αλλαγές.</p>

                <b>10. Πνευματική Ιδιοκτησία</b>
                <p>Όλο το περιεχόμενο της πλατφόρμας αποτελεί πνευματική ιδιοκτησία της Groundo Development και προστατεύεται από τη νομοθεσία περί πνευματικών δικαιωμάτων.</p>
            </div>
        </div>
    )
}
